In [14]:
# Load kedro environment (not needed in .py)
from pathlib import Path
from kedro.framework.context import load_context
import numpy as np

# Load a context to be able to work in the notebook
#current_dir = Path.cwd()
current_dir = Path("/u01/share/cesar/aa_engine_uy/notebooks/")
proj_path = current_dir.parent
context = load_context(proj_path)
catalog = context.catalog
credentials = context.config_loader.get("credentials*","credentials*/**")
parameters = context.config_loader.get("parameters*","parameters*/**")

In [2]:
arpuQ=catalog.load("arpu_quality")

2020-12-14 14:07:06,749 - kedro.io.data_catalog - INFO - Loading data from `arpu_quality` (SQLPartitionedDataSet)...

In [4]:
arpuQ=arpuQ.filter_by_query("select * from stg_uy_arpu_quality")

/u01/miniconda3/envs/uypo37/lib/python3.7/site-packages/sqlalchemy/dialects/oracle/base.py:1381: SAWarning: Oracle version (19, 5, 0, 0, 0) is known to have a maximum identifier length of 128, rather than the historical default of 30. SQLAlchemy 1.4 will use 128 for this database; please set max_identifier_length=128 in create_engine() in order to test the application with this new length, or set to 30 in order to assure that 30 continues to be used.  In particular, pay close attention to the behavior of database migrations as dynamically generated names may change. See the section 'Max Identifier Lengths' in the SQLAlchemy Oracle dialect documentation for background.
  % ((self.server_version_info,))

In [6]:
arpuQ.head()

,CUSTOMER_ID,CHARGES_YYYYMM,CHARGES_AMOUNT,DISCOUNT_AMOUNT,ARPU,DATE_EXP
0,610364,202002,2445.07,-813.12,1631.95,202002
1,55340840,202002,2434.42,-801.64,1632.78,202002
2,51014995,202002,2371.30,-738.52,1632.78,202002
3,54031393,202002,2225.40,-591.81,1633.59,202002
4,2373819,202002,1998.36,-364.75,1633.61,202002

In [27]:
1631.95-2445.07-(-813.12)

-1.1368683772161603e-13

In [11]:
arpuQ.groupby(["DATE_EXP"]).agg({'CUSTOMER_ID':'nunique','CHARGES_AMOUNT':['count','mean'],'DISCOUNT_AMOUNT':['count','mean'],'ARPU':['count','mean']})

         CUSTOMER_ID CHARGES_AMOUNT              DISCOUNT_AMOUNT              \
             nunique          count         mean           count        mean
DATE_EXP
202001        116356         116356  2245.786032          116356 -427.518266
202002        115934         115934  2264.755508          115934 -436.996776

            ARPU
           count         mean
DATE_EXP
202001    116356  1818.267766
202002    115934  1827.758732

In [15]:
arpuQ["discount_01"]=np.where(arpuQ.DISCOUNT_AMOUNT==0,1,0)
arpuQ.groupby("DATE_EXP").agg({'discount_01':'mean'})

          discount_01
DATE_EXP
202001       0.474269
202002       0.466170

In [63]:
#ARPU-CHARGES_AMOUNT+DISCOUNT_AMOUNT
arpuQ["dd"]=abs(arpuQ.ARPU - (arpuQ.CHARGES_AMOUNT+arpuQ.DISCOUNT_AMOUNT))
arpuQ["flag"]=np.where(arpuQ.dd<0.0001,1,0)

In [66]:
arpuQ.flag.mean()

1.0